# running in sha512/model/
read_ilang design.il
memory_nordff
scc -select; simplemap; select -clear
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -smtcheck
dffunmap
stat
write_smt2 -wires design_smt2.smt2
